Repository: Khadaassi/Simplon_Rawina2.0
Catalog: App/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Rawina Admin
fr: Administration Rawina

source: Rawina Admin Portal
fr: Portail d'administration Rawina

source: Welcome to the Rawina Admin Portal
fr: Bienvenue sur le portail d'administration de Rawina

source: Your Name
fr: Votre nom

source: Main Character
fr: Personnage principal

source: Story Place
fr: Cadre de l'histoire

source: Fantasy
fr: Fantastique

source: Animals
fr: Animaux

source: Daily Hero
fr: Héros du quotidien

source: Character Name
fr: Nom du personnage

source: Character Type
fr: Type de personnage

source: e.g., a brave child, a clever fox...
fr: ex. : un enfant courageux, un renard malin...

source: Setting
fr: Décor

source: e.g., an enchanted forest, a flying train...
fr: ex. : une forêt enchantée, un train volant...

source: Theme
fr: Thème

source: e.g., adventure, friendship, courage...
fr: ex. : aventure, amitié, courage...

source: User
fr: Utilisateur

source: Title
fr: Titre

source: Title (English)
fr: Texte généré

source: Generated Text (English)
fr: Texte généré

source: Automatically generated text
fr: Texte généré automatiquement

source: Generated Text (French)
fr: Texte généré

source: Created At
fr: Créé le

source: Create Story - RAWINA
fr: Créer une histoire - RAWINA

source: Choose Your Adventure Theme
fr: Choisis le thème de ton aventure

source: Magic, castles, dragons...
fr: Magie, châteaux, dragons...

source: Tales with furry friends.
fr: Contes avec nos amis tout doux

source: Courage in everyday life.
fr: Héros d'un jour, Héros toujours!

source: Create Story
fr: Créer une Histoire

source: Back to Dashboard
fr: Retour au Tableau de Bord

source: Create a New Story
fr: Créer une Nouvelle Histoire

source: Selected Theme:
fr: Thème Sélectionné :

source: Main Character's name
fr: Nom du personnage principal

source: e.g. Lina
fr: ex. : Lina

source: Main Character Description
fr: Description du personnage principal

source: e.g. a brave cat
fr: ex. : un chat courageux

source: Story Setting
fr: Cadre de l’histoire

source: e.g. in the enchanted forest
fr: ex. : dans la forêt enchantée

source: Dashboard - RAWINA
fr: Tableau de Bord - RAWINA

source: Tools
fr: Outils

source: Interactive Story
fr: Histoire Interactive

source: All Stories
fr: Toutes les Histoires

source: Account Settings
fr: Paramètres du Compte

source: Here you can manage your stories and account settings.
fr: Ici, tu peux gérer tes histoires et les paramètres de ton compte.

source: Create a new Story
fr: Créer une Nouvelle Histoire

source: Start an Interactive Story Adventure
fr: Commencer une Aventure Interactive

source: Your Stories
fr: Tes histoires

source: You have no stories yet.
fr: Tu n’as pas encore créé d’histoires.

source: Start writing
fr: Commencer à écrire

source: Interactive Story Theme - RAWINA
fr: Thème de l’histoire interactive - RAWINA

source: Choose Your Interactive Story Theme
fr: Choisis le thème de ton histoire interactive

source: Next Step
fr: Étape Suivante

source: Interactive Story Setup - RAWINA
fr: Configuration de l’histoire interactive - RAWINA

source: Start Your Interactive Story
fr: Commence ton histoire interactive

source: Character Description
fr: Description du personnage

source: e.g. a floating castle
fr: ex. : un château flottant

source: Launch Story
fr: Lancer l’histoire

source: Back to Theme Selection
fr: Retour à la sélection du thème

source: Interactive Story - RAWINA
fr: Histoire Interactive - RAWINA

source: Your Interactive Adventure
fr: Ton aventure interactive

source: The story has ended! Thank you for playing.
fr: L’histoire est terminée ! Merci d’avoir joué.

source: Full Story:
fr: Histoire Complète :

source: Start New Story
fr: Commencer une nouvelle histoire

source: Chapter
fr: Chapitre

source: What do you want to do next?
fr: Que veux-tu faire ensuite ?

source: Leave the story?
fr: Quitter l'Histoire?

source: If you leave now, your interactive story will be lost.
fr: Si vous quittez maintenant, l’histoire sera perdue.

source: But don’t worry — just 5 choices are enough to reach an ending!
fr: Mais un peu de patience : 5 choix suffisent pour découvrir une fin !

source: Continue story
fr: Continuer l'histoire

source: Quit anyway
fr: Quitter

source: Generating Story...
fr: Génération de l’histoire...

source: Loading Owl
fr: Hibou en chargement

source: Rawi is creating your story...
fr: Rawi est en train de créer ton histoire...

source: He's gathering sparkles, ideas, and imagination to create something magical for you. Please wait a few seconds while the tale comes to life.
fr: Il rassemble des étincelles, des idées et de l’imagination pour créer quelque chose de magique pour toi. Patiente quelques secondes pendant que le conte prend vie.

source: Your adventure is almost ready...
fr: Ton aventure est presque prête...

source: The End - RAWINA
fr: Fin - RAWINA

source: The End of Your Adventure
fr: Fin de ton aventure

source: Thank you for exploring this interactive story!
fr: Merci d’avoir exploré cette histoire interactive !

source: Full Story
fr: Histoire complète

source: Start a New Story
fr: Commencer une nouvelle histoire

source: Delete Story - RAWINA
fr: Supprimer l’histoire - RAWINA

source: Delete Story
fr: Supprimer l’histoire

source: Are you sure you want to delete the story "<strong>%(title)s</strong>"?
fr: Es-tu sûr(e) de vouloir supprimer l’histoire « <strong>%(title)s</strong> » ?

source: This action cannot be undone. All data associated with this story will be permanently removed.
fr: Cette action est irréversible. Toutes les données liées à cette histoire seront supprimées définitivement.

source: Cancel
fr: Annuler

source: Theme: %(theme)s • Created on %(created)s
fr: Thème : %(theme)s • Créée le %(created)s

source: Your Stories - RAWINA
fr: Tes histoires - RAWINA

source: Read more →
fr: Lire la suite →

source: ⬇ Download PDF
fr: ⬇ Télécharger le PDF

source: Delete
fr: Supprimer

source: You haven't created any stories yet.
fr: Tu n’as pas encore créé d’histoires.

source: Start here
fr: Commence ici

source: Theme:
fr: Thème :

source: Untitled Story
fr: Histoire sans titre

source: ⚠️ Story generation failed.
fr: ⚠️ Échec de la génération de l’histoire.

source: {name}'s Story
fr: L’histoire de {name}

source: Narrator session not found.
fr: Session du narrateur introuvable.

source: Back
fr: Retour

source: Your browser does not support the audio element.
fr: Ton navigateur ne supporte pas l’élément audio.

source: RAWINA logo
fr: Logo RAWINA

source: Login
fr: Connexion

source: Sign Up
fr: Créer un compte

source: Toggle sound
fr: Activer/Désactiver le son

source: Crafted with imagination.
fr: Conçu avec imagination.

source: All rights reserved.
fr: Tous droits réservés.

source: The browser blocked autoplay. Please check your settings.
fr: Le navigateur a bloqué la lecture automatique. Vérifie tes paramètres.

source: Audio not supported
fr: Audio non supporté

source: Logout
fr: Déconnexion

source: Username
fr: Nom d’utilisateur

source: Enter your username
fr: Entre ton nom d’utilisateur

source: Email
fr: Adresse e-mail

source: Enter your email address
fr: Entre ton adresse e-mail

source: Password
fr: Mot de passe

source: Enter your password
fr: Entre ton mot de passe

source: Confirm Password
fr: Confirme le mot de passe

source: Confirm your password
fr: Confirme ton mot de passe

source: Account Settings - RAWINA
fr: Paramètres du Compte - RAWINA

source: Settings
fr: Paramètres

source: Dashboard
fr: Tableau de Bord

source: Edit Profile
fr: Modifier le Profil

source: Change Password
fr: Changer le Mot de Passe

source: Welcome to Your Account
fr: Bienvenue sur ton compte

source: Manage your account settings and preferences.
fr: Gère les paramètres et préférences de ton compte.

source: Account Information
fr: Informations du Compte

source: Username:
fr: Nom d’utilisateur :

source: Email:
fr: Adresse e-mail :

source: Change Password - RAWINA
fr: Changer le Mot de Passe - RAWINA

source: Current Password
fr: Mot de passe actuel

source: Enter current password
fr: Entre ton mot de passe actuel

source: New Password
fr: Nouveau mot de passe

source: Enter new password
fr: Entre ton nouveau mot de passe

source: Confirm New Password
fr: Confirme le nouveau mot de passe

source: Confirm new password
fr: Confirme ton nouveau mot de passe

source: Update Password
fr: Mettre à jour le mot de passe

source: Back to Account Settings
fr: Retour aux Paramètres du Compte

source: Edit Profile - RAWINA
fr: Modifier le Profil - RAWINA

source: Save Changes
fr: Enregistrer les Modifications

source: Welcome
fr: Bienvenue sur

source: Welcome to
fr: Bienvenue sur

source: A storybook maker for little dreamers — where imagination meets storytelling.
fr: Un créateur d'histoires pour petits rêveurs — là où l’imagination rencontre le récit.

source: How It Works
fr: Comment ça marche

source: Details
fr: Détails

source: Generate
fr: Génère

source: Choose a Theme
fr: Choisis un thème

source: Fantasy, animals or daily heroes — pick your favorite world to explore.
fr: Fantastique, animaux ou héros du quotidien — choisis ton univers préféré à explorer.

source: Add Some Details
fr: Ajoute quelques détails

source: Answer a few fun questions to shape your story’s hero and setting.
fr: Rawina te posera quelques questions pour faire jaillir ton imagination.

source: Get Your Story
fr: Découvre ton histoire

source: Your story is generated — ready to read, listen to, or download!
fr: Ton histoire est prête — à lire, écouter ou télécharger !

source: Login - RAWINA
fr: Connexion - RAWINA

source: Login to your Account
fr: Connecte-toi à ton compte

source: Don't have an account yet?
fr: Tu n’as pas encore de compte ?

source: Create Your RAWINA Account
fr: Crée ton compte RAWINA

source: Already have an account?
fr: Tu as déjà un compte ?

source: Log In
fr: Se connecter

source: Current password is incorrect.
fr: Le mot de passe actuel est incorrect.

source: New passwords do not match.
fr: Les nouveaux mots de passe ne correspondent pas.

source: New password must be at least 8 characters.
fr: Le nouveau mot de passe doit contenir au moins 8 caractères.

source: Your password has been changed successfully.
fr: Ton mot de passe a bien été modifié.
